IDENTIFICATION DIVISION.
PROGRAM-ID. PROGAMAUM.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 I        PIC 9(1).
    01 J        PIC 9(1).
    01 VETOR.
        05 ELEMENTO OCCURS 5 TIMES PIC 9(1).
    01 VETORINVERTIDO.
        05 ELEMENTOINVERTIDO OCCURS 5 TIMES PIC 9(1).
    01 TAMANHO  PIC 9(1).
PROCEDURE DIVISION.

    MOVE 1 TO ELEMENTO(1).
    MOVE 2 TO ELEMENTO(2).
    MOVE 5 TO ELEMENTO(3).
    MOVE 9 TO ELEMENTO(4).
    MOVE 0 TO ELEMENTO(5).
    
    MOVE 5 TO TAMANHO.
    
    DISPLAY "VALORES DO VETOR:".
    
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        DISPLAY "ELEMENTO("I"):" ELEMENTO(I)
        MOVE ELEMENTO(I) TO ELEMENTOINVERTIDO(TAMANHO)
        SUBTRACT 1 FROM TAMANHO
    END-PERFORM.
       
    
    PERFORM VARYING J FROM 1 BY 1 UNTIL J >5
        DISPLAY "ELEMENTO INVERTIDO("J"):" ELEMENTOINVERTIDO(J)
    END-PERFORM.
       
STOP RUN.
